@doc cap_enter(2): place process into capability mode

FreeBSD only.

== Examples ==

```
1> {ok, Drv} = alcove_drv:start().
{ok,<0.208.0>}
2> {ok, Pid1} = alcove:fork(Drv, []).
{ok,75331}
3> {ok, Pid2} = alcove:fork(Drv, []).
{ok,75332}
4> ok = alcove:cap_enter(Drv, [Pid1]).
ok
5> alcove:kill(Drv, [Pid1], 0, 0).
{error,ecapmode}
6> alcove:kill(Drv, [Pid2], 0, 0).
ok
7> alcove:kill(Drv, [], 0, 0).
ok
'''
